problem link: https://leetcode.com/problems/department-top-three-salaries/description/?lang=pythondata

In [1]:
import pandas as pd

### Generating test cases

In [25]:
employee=pd.read_csv('./test_data/p185_employee_test1.csv',delimiter='|')
employee

   id   name  salary  departmentId
0   1    Joe   85000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1
4   5  Janet   69000             1
5   6  Randy   85000             1
6   7   Will   70000             1

In [26]:
employee.dtypes

id               int64
name            object
salary           int64
departmentId     int64
dtype: object

In [27]:
employee.columns

Index(['id', 'name', 'salary', 'departmentId'], dtype='object')

In [28]:
department=pd.read_csv('./test_data/p185_department_test1.csv',delimiter='|')
department

   id   name
0   1     IT
1   2  Sales

In [29]:
department.dtypes

id       int64
name    object
dtype: object

In [30]:
department.columns

Index(['id', 'name'], dtype='object')

### Solving problem

In [31]:
#renaming columns
employee=employee.rename(columns={'name':'Employee','salary':'Salary'})
department=department.rename(columns={'name':'Department','id':'departmentId'})

In [32]:
#merging the dataframes
employee=employee.merge(department,on='departmentId')
employee

   id Employee  Salary  departmentId Department
0   1      Joe   85000             1         IT
1   2    Henry   80000             2      Sales
2   3      Sam   60000             2      Sales
3   4      Max   90000             1         IT
4   5    Janet   69000             1         IT
5   6    Randy   85000             1         IT
6   7     Will   70000             1         IT

In [ ]:
employee['rank']=employee.groupby(by='Department')['Salary'].rank(method='dense',ascending=False)   #getting ranks by dept
employee

   id Employee  Salary  departmentId Department  rank
0   1      Joe   85000             1         IT   2.0
1   2    Henry   80000             2      Sales   1.0
2   3      Sam   60000             2      Sales   2.0
3   4      Max   90000             1         IT   1.0
4   5    Janet   69000             1         IT   4.0
5   6    Randy   85000             1         IT   2.0
6   7     Will   70000             1         IT   3.0

In [36]:
#getting employees within first 3 ranks
employee[employee['rank']<=3][['Department','Employee','Salary']]

  Department Employee  Salary
0         IT      Joe   85000
1      Sales    Henry   80000
2      Sales      Sam   60000
3         IT      Max   90000
5         IT    Randy   85000
6         IT     Will   70000

### Preparing Submission function

In [40]:
import pandas as pd

def top_three_salaries(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    #renaming columns
    employee=employee.rename(columns={'name':'Employee','salary':'Salary'})
    department=department.rename(columns={'name':'Department','id':'departmentId'})

    #merging the dataframes
    employee=employee.merge(department,on='departmentId')

    #getting dept wise salary rank 
    employee['rank']=employee.groupby(by='Department')['Salary'].rank(method='dense',ascending=False)

    #getting employees within first 3 ranks
    return employee[employee['rank']<=3][['Department','Employee','Salary']]

### Testing the submission function

In [38]:
employee=pd.read_csv('./test_data/p185_employee_test1.csv',delimiter='|')
employee

   id   name  salary  departmentId
0   1    Joe   85000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1
4   5  Janet   69000             1
5   6  Randy   85000             1
6   7   Will   70000             1

In [39]:
department=pd.read_csv('./test_data/p185_department_test1.csv',delimiter='|')
department

   id   name
0   1     IT
1   2  Sales

In [41]:
top_three_salaries(employee=employee,department=department)

  Department Employee  Salary
0         IT      Joe   85000
1      Sales    Henry   80000
2      Sales      Sam   60000
3         IT      Max   90000
5         IT    Randy   85000
6         IT     Will   70000